<?php

namespace app\models;

class Province extends Model
{
    public static function getList()
    {
        return [
            1 => 'آذربایجان شرقی - تبریز - مراغه ، مرند و میانه',
            2 => 'آذربایجان غربی - ارومیه - خوی ، میاندوآب و مهاباد',
            3 => 'اردبیل - اردبیل - پارس آباد ، مشگین شهر و خلخال',
            4 => 'اصفهان - اصفهان - کاشان ، خمینی شهر و نجف آباد',
            5 => 'البرز - کرج - هشتگرد ، نظرآباد و محمدشهر',
            6 => 'ایلام - ایلام - ایوان ، دهلران و آبدانان',
            7 => 'بوشهر - بندر بوشهر - برازجان ، بندر گناوه و خورموج',
            8 => 'تهران - تهران - اسلام شهر ، گلستان و قدس',
            9 => 'چهارمحال و بختیاری - شهرکرد - بروجن ، فرخ شهر و فارسان',
            10 => 'خراسان جنوبی - بیرجند - قائن ، فردوس و نهبندان',
            11 => 'خراسان رضوی - مشهد - سبزوار ، نیشابور و تربت حیدریه',
            12 => 'خراسان شمالی - بجنورد - شیروان ، اسفراین و گرمه جاجرم',
            13 => 'خوزستان - اهواز - دزفول ، آبادان و خرمشهر',
            14 => 'زنجان - زنجان - ابهر ، خرمدره و قیدار',
            15 => 'سمنان - سمنان - شاهرود ، دامغان و گرمسار',
            16 => 'سیستان و بلوچستان - زاهدان - زابل ، ایرانشهر و چابهار',
            17 => 'فارس - شیراز - کازرون ، جهرم ، لار و مرودشت',
            18 => 'قزوین - قزوین - تاکستان ، الوند و اقبالیه',
            19 => 'قم - قم - قنوات ، جعفریه و کهک',
            20 => 'کردستان - سنندج - سقز ، مریوان و بانه',
            21 => 'کرمان - کرمان - سیرجان ، رفسنجان و جیرفت',
            22 => 'کرمانشاه - کرمانشاه - اسلام آباد غرب ، هرسین و کنگاور',
            23 => 'کهگیلویه و بویراحمد - یاسوج - دوگنبدان ، دهدشت و لیکک',
            24 => 'گلستان - گرگان - گنبد کاووس ، علی آباد کتول و بندر ترکمن',
            25 => 'گیلان - رشت - بندر انزلی ، لاهیجان و لنگرود',
            26 => 'لرستان - خرم آباد - بروجرد ، دورود و کوهدشت',
            27 => 'مازندران - ساری - بابل ، آمل و قائم شهر',
            28 => 'مرکزی - اراک - ساوه ، خمین و محلات',
            29 => 'هرمزگان - بندرعباس - میناب ، دهبارز و بندر لنگه',
            30 => 'همدان - همدان - ملایر ، نهاوند و تویسرکان',
            31 => 'یزد - یزد - میبد ، اردکان و بافق',
        ];
    }

    public static function getLabel($item)
    {
        $list = self::statuses();
        return (isset($list[$item]) ? $list[$item] : null);
    }
}
